docs: modified architecture.md
